import java.util.Scanner;

/* Задача наполнить корабельный бассейн. Нужно посчитать, сколько литров воды нужно для заполнения бассейна до бортов.
Известно, что бассейн имеет линейные размеры a × b × c, заданные в метрах.
Эти размеры передаются запрашиваются у пользователя. Прграмма должена вывести на экран количество литров воды,
которое нужно для наполнения бассейна.
Пример:
Пользователь даёт числа 25, 5, 2.
Пример вывода:
250000 */
    public class Main {
        public static void main(String[] args) {
        Scanner s = new Scanner(System.in);
        System.out.println("Введите ширину бассейна в метрах, пожалуйста");
        int a = s.nextInt();
        System.out.println("Введите длину бассейна в метрах, пожалуйста");
        int b = s.nextInt();
        System.out.println("Введите глубину бассейна в метрах, пожалуйста");
        int c = s.nextInt();
        System.out.println("Объём бассейна равен " + a*b*c*1000 + " литров");
        }
    }
